using System; // Предоставя основни типове данни и функционалност в .NET
using System.ComponentModel.DataAnnotations; // Съдържа атрибути, които се използват за валидация и на данни и описание на метаданни в класовете на модела

namespace MvcTransplantation_kidney.Models // Дефинира се пространства от имена 'MvcTransplantation_kidney.Models', което групира свързани класове и други типове
{

    // Дефинира публичен клас 'Doctor'
    public class Doctor
    {
        [Key] // Първичен ключ 
        public int DoctorId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'DoctorId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'DoctorId'
        }

        [Required] // Задължително поле
        [Display(Name = "ИД на потребителя")] // Името на полето в потребителския интерфейс
        public int UserId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'UserId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'UserId'
        }

        [Required] // Задължително поле
        [StringLength(20)] // Поле с дължина 20 символа
        [Display(Name = "Име")] // Името на полето в потребителския интерфейс
        public string FirstName { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'FirstName'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'FirstName'
        }

        [Required] // Задължително поле
        [StringLength(30)] // Поле с дължина 30 символа
        [Display(Name = "Фамилия")] // Името на полето в потребителския интерфейс
        public string LastName { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'LastName'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'LastName'
        }

        [Required] // Задължително поле
        [StringLength(100)] // Поле с дължина 100 символа
        [Display(Name = "Специалност")] // Името на полето в потребителския интерфейс 
        public string Specialty { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'Specialty'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'Specialty'
        }

        // Дефинира свойство 'MedicalRecords', което е колекция от обекти 'MedicalRecord'. Тази колекция съхранява всички медицински досиета, свързани с дадения доктор. Знакът ? след типа показва, че това свойство може да бъде null, тоест може да няма свързани медицински досиета.
        public ICollection<MedicalRecord>? MedicalRecords { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'MedicalRecords'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'MedicalRecords'
        }
    }
}
