using System; // Предоставя основни типове данни и функционалност в .NET
using System.ComponentModel.DataAnnotations; // Съдържа атрибути, които се използват за валидация и на данни и описание на метаданни в класовете на модела

namespace MvcTransplantation_kidney.Models // Дефинира се пространства от имена 'MvcTransplantation_kidney.Models', което групира свързани класове и други типове
{

    // Дефинира публичен клас 'MedicalRecord'
    public class MedicalRecord
    {
        [Key] // Първичен ключ
        public int RecordId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'RecordId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'RecordId'
        }

        [Required] // Задължително поле 
        [Display(Name = "ИД на пациент")] // Името на полето в потребителския интерфейс
        public int PatientId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'PatientId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'PatientId'
        }

        [Required] // Задължително поле
        [Display(Name = "ИД на доктор")] // Името на полето в потребителския интерфейс
        public int DoctorId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'DoctorId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'DoctorId'
        }

        [Required] // Задължително поле
        [Display(Name = "Дата")] // Името на полето в потребителския интерфейс 
        [DataType(DataType.Date)] // Поле от тип дата
        public DateTime RecordDate {  
            get; // Метод за получаване, която връща текущата стойност на свойството 'RecordDate'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'RecordDate'
        }

        [Required] // Задължително поле
        [StringLength(255)] // Поле с дължина 255 символа
        [Display(Name = "Описание")] // Името на полето в потребителския интерфейс
        public string Description { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'Description'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'Description'
        }


        // Дефинира свойство 'Patient', което е от тип 'Patient'. Това свойство представлява навигационното свойство, което създава връзка с обект от тип 'Patient'. То може да бъде null, което се указва със символа '?'.
        public Patient? Patient { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'Patient'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'Patient'
        }

        // Дефинира свойство 'Doctor', което е от тип 'Doctor'. Това свойство представлява навигационното свойство, което създава връзка с обект от тип 'Doctor'. То може да бъде null, което се указва със символа '?'.
        public Doctor? Doctor { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'Doctor'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'Doctor'
        }
    }
}
