using System; // Предоставя основни типове данни и функционалност в .NET
using System.ComponentModel.DataAnnotations; // Съдържа атрибути, които се използват за валидация и на данни и описание на метаданни в класовете на модела

namespace MvcTransplantation_kidney.Models // Дефинира се пространства от имена 'MvcTransplantation_kidney.Models', което групира свързани класове и други типове
{

    // Дефинира публичен клас 'Message'
    public class Message
    {
        [Key] // Първичен ключ 
        public int MessageId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'MessageId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'MessageId'
        }

        [Required] // Задължително поле
        [Display(Name = "ИД на доктор")] // Името на полето в потребителския интерфейс
        public int DoctorId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'DoctorId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'DoctorId'
        }

        [Required] // Задължително поле
        [Display(Name = "ИД на пациент")] // Името на полето в потребителския интерфейс
        public int PatientId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'PatientId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'PatientId'
        }

        [Required] // Задължително поле
        [StringLength(255)] // Поле с дължина 255 символа
        [Display(Name = "Съобщение")] // Името на полето в потребителския интерфейс
        public string MessageText { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'MessageText'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'MessageText'
        }

        [Required] // Задължително поле
        [Display(Name = "Дата на изпращане")] // Името на полето в потребителския интерфейс 
        [DataType(DataType.Date)] // Поле от тип дата
        public DateTime SentDate { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'SentDate'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'SentDate'
        }
    }
}
