using System; // Предоставя основни типове данни и функционалност в .NET
using System.ComponentModel.DataAnnotations; // Съдържа атрибути, които се използват за валидация и на данни и описание на метаданни в класовете на модела

namespace MvcTransplantation_kidney.Models // Дефинира се пространства от имена 'MvcTransplantation_kidney.Models', което групира свързани класове и други типове
{

    // Дефинира публичен клас 'Patient'
    public class Patient
    {
        [Key] // Първичен ключ
        public int PatientId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'PatientId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'PatientId'
        }

        [Required] // Задължително поле
        [StringLength(20)] // Поле с дължина 20 символа 
        [Display(Name = "Име")] // Името на полето в потребителския интерфейс
        public string FirstName { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'FirstName'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'FirstName'
        }

        [Required] // Задължително поле
        [StringLength(30)] // Поле с дължина 30 символа
        [Display(Name = "Фамилия")] // Името на полето в потребителския интерфейс
        public string LastName { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'LastName'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'LastName'
        }

        [Required] // Задължително поле
        [Display(Name = "Дата на раждане")] // Името на полето в потребителския интерфейс 
        [DataType(DataType.Date)] // Поле от тип дата
        public DateTime DateOfBirth { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'DateOfBirth'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'DateOfBirth'
        }

        [Required] // Задължително поле
        [Display(Name = "Дата на трансплантацията")] // Името на полето в потребителския интерфейс
        [DataType(DataType.Date)] // Поле от тип дата
        public DateTime TransplantDate { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'TransplantDate'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'TransplantDate'
        }

        // Дефинира свойство 'MedicalRecords', което е колекция от обекти 'MedicalRecord'. Тази колекция съхранява всички медицински досиета, свързани с дадения пациент. Знакът ? след типа показва, че това свойство може да бъде null, тоест може да няма свързани медицински досиета.
        public ICollection<MedicalRecord>? MedicalRecords { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'MedicalRecords'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'MedicalRecords'
        }
    }
}
