using System; // Предоставя основни типове данни и функционалност в .NET
using System.ComponentModel.DataAnnotations; // Съдържа атрибути, които се използват за валидация и на данни и описание на метаданни в класовете на модела

namespace MvcTransplantation_kidney.Models // Дефинира се пространства от имена 'MvcTransplantation_kidney.Models', което групира свързани класове и други типове
{

    // Дефинира публичен клас 'Permission'
    public class Permission
    { 
        [Key] // Първичен ключ
        public int PermissionId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'PermissionId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'PermissionId'
        }

        [Required] // Задължително поле
        [Display(Name = "ИД на потребителя")] // Името на полето в потребителския интерфейс
        public int UserId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'UserId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'UserId'
        }

        [Required] // Задължително поле
        [StringLength(20)] // Поле с дължина 20 символа
        [Display(Name = "Вид на разрешението")] // Името на полето в потребителския интерфейс
        public string PermissionType { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'PermissionType'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'PermissionType'
        }


        // Дефинира свойство 'User', което е от тип 'User'. Това свойство представлява навигационното свойство, което създава връзка с обект от тип 'User'. То може да бъде null, което се указва със символа '?'.
        public User? User { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'User'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'User'
        }
    }
}
