using System; // Предоставя основни типове данни и функционалност в .NET
using System.ComponentModel.DataAnnotations; // Съдържа атрибути, които се използват за валидация и на данни и описание на метаданни в класовете на модела

namespace MvcTransplantation_kidney.Models // Дефинира се пространства от имена 'MvcTransplantation_kidney.Models', което групира свързани класове и други типове
{
    // Дефинира публичен клас 'Role'
    public class Role
    {
        //Конструктор на класа 'Role'
        public Role()
        {
            // Инициализира се свойството 'UserRole' с нова празна колекция от типа 'HashSet<UserRole>'
            UserRoles = new HashSet<UserRole>(); 
        }


        [Key] // Първичен ключ 
        public int RoleId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'RoleId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'RoleId'
        }

        [Required] // Задължително поле
        [StringLength(20)] // Поле с дължина 20 символа
        [Display(Name = "Роля")] // Името на полето в потребителския интерфейс
        public string RoleName { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'RoleName'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'RoleName'
        }


        //Свойството 'UserRoles' е колекция от обекти 'UserRole', която указва връзката "много към много" между ролите и потребителите.
        public ICollection<UserRole> UserRoles { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'UserRoles'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'UserRoles'
        }
    }
}
