using System; // Предоставя основни типове данни и функционалност в .NET
using System.ComponentModel.DataAnnotations; // Съдържа атрибути, които се използват за валидация и на данни и описание на метаданни в класовете на модела

namespace MvcTransplantation_kidney.Models // Дефинира се пространства от имена 'MvcTransplantation_kidney.Models', което групира свързани класове и други типове
{

    // Дефинира публичен клас 'User'
    public class User
    {
        //Конструктор на класа 'User'
        public User()
        {
            // Инициализират се свойствата 'UserRole' и 'Permission' с нова празна колекция от типа 'HashSet<UserRole>'
            UserRoles = new HashSet<UserRole>();
            Permissions = new HashSet<Permission>();
        }

        [Key] // Първичен ключ
        public int UserId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'UserId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'UserId'
        }


        [Required] // Задължително поле
        [StringLength(20)] // Поле с дължина 20 символа
        [Display(Name = "Потребителско име")] // Името на полето в потребителския интерфейс
        public string UserName { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'UserName'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'UserName'
        }

        [Required] // Задължително поле
        [StringLength(255)] // Поле с дължина 255 символа
        [Display(Name = "Парола")] // Името на полето в потребителския интерфейс
        public string Password { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'Password'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'Password'
        }

        [Required] // Задължително поле
        [Display(Name = "ИД на ролята")] // Името на полето в потребителския интерфейс
        public int RoleId { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'RoleId'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'RoleId'
        }

        // Свойството 'UserRoles' е колекция от обекти 'UserRole', която указва връзката "много към много" между ролите и потребителите.
        public ICollection<UserRole> UserRoles { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'UserRoles'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'UserRoles'
        }

        // Свойството 'Permissions' е колекция от обекти 'Permission', която указва всички разрешения (permissions), свързани с този потребител.
        public ICollection<Permission> Permissions { 
            get; // Метод за получаване, която връща текущата стойност на свойството 'Permissions'
            set; // Метод за задаване, която позволява да се зададе нова стойност на 'Permissions'
        }
    }
}
